---
kind: type
id: T:Autodesk.Revit.UI.ExternalCommandData
source: html/e9aab085-720f-b924-3ace-1f3c33d95d44.htm
---
# Autodesk.Revit.UI.ExternalCommandData

A class contains reference to Application and View which are needed by external command.

## Syntax (C#)
```csharp
public class ExternalCommandData : APIObject
```